Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G44A.tmx
Source language: en_us
Languages: zh_cn

source: ONE
zh_cn: 第一章

source: BECOMING A MAN
zh_cn: 长大成人

source: IT IS FASCINATING FOR ME TO SIT AND LOOK BACK AT THE road I have traveled to get to where I am now--not only in my career, but in my personal life as well.
zh_cn: 回望自己演艺生涯和舞台之外的生活所走过的路是一件很有意思的事情。

source: What has at times felt incomprehensible or excessively difficult, today I understand as something that had to happen.
zh_cn: 我当年曾认为无法理喻和困难重重的事情，现在看来都是有它们存在的意义。

source: All my experiences have prepared me for what was--and still is--ahead of me.
zh_cn: 我曾经历的那些事情，决定了我现在走还有未来要走下去的路。

source: At first it was a difficult concept for me to grasp, but once I was able to internalize it, I got to a point where I could live a more complete and satisfactory life because I am willing to accept that the good, the bad, and the not so great are all part of a whole.
zh_cn: 认识到这一点并不容易，不过当我真正理解了之后，我发现我的生活变得更加完整和令人满意，因为我统统地接受了我生活中的好与坏、以及不好不坏的一切。

source: This feeling has liberated me in so many ways and given me the strength to confront everything that comes my way.
zh_cn: 这样的认识让我的生活如释重负，也让我能从容面对今后生活中的一切。

source: It is extraordinary to think that without knowing it, from very early on, I was already building my identity, my very own story.
zh_cn: 难道不是吗，在不知不觉中，我们都在打造自己的生活，书写自己的故事。

source: GETTING STARTED
zh_cn: 一切的开始

source: IT ALL BEGAN with a spoon.
zh_cn: 一切都源于一把勺子。

source: Anybody in my family will tell you that music came into my life at a very young age.
zh_cn: 我家的每个人都会告诉你，音乐从小就融入了我的生活。

source: My mother's side of the family has always been musically inclined.
zh_cn: 我母亲的家族一向都有很好的音乐天赋。

source: On Sunday afternoons we would get together at my grandparents' house, and sooner or later someone would pull out a guitar and start singing.
zh_cn: 周末的下午，全家人都会齐聚在外祖父家，然后就会有人不自觉地拿出吉他弹唱起来。

source: My grandfather, for example, was a poet, a good one. His rhymed improvisations were romantic and very stylized, in a way I have never heard again.
zh_cn: 我的外祖父是一位出色的诗人，他的即兴诗常常韵律整齐，而且十分浪漫和极具风格。

source: My grandfather was a firm man, very conservative, and completely devoted to his family.
zh_cn: 我爷爷是一位电影人，是一个传统并且顾家的好男人。

source: Like most men of his generation he was very macho, but if there is one thing he taught all of us men who carry his name, it is the importance of showing respect to a woman, the beauty of admiring her, caring for her, and protecting her.
zh_cn: 和他那个时代的人一样，他十分大男子主义，不过他也教导家里的每个男人要尊重和赞赏女人、要关照和保护女人。

source: He would always say to us: "A woman must be treated with the subtle delicacy that you would give to a rose petal."
zh_cn: 他常常对我们这样说：“要像对待玫瑰花瓣一样对待女人。”

source: He was obviously a hopeless romantic, a quality that I have, without a doubt, inherited.
zh_cn: 爷爷是一个无可救药的浪漫主义者，很显然我很好地继承了这一点。

source: From the time I was six years old, I would grab a wooden kitchen spoon and use it as a microphone to sing. I would spend hours upon hours with the spoon in my hand, interpreting my favorite songs--Menudo songs, or songs from American rock bands, such as REO Speedwagon, Journey, and Led Zeppelin, which is what my older siblings were listening to at the time.
zh_cn: 从我六岁起，我便经常手握木勺把它当成话筒，然后花好几个小时来演唱我最喜欢个歌曲、也是我兄长们最喜欢的歌曲——Menudo乐队的歌曲、美国摇滚乐队个歌曲，比如REO Speedwagon、Journey还有Led Zeppelin。

source: I remember many times we were all at my grandparents' house, and while everyone was sitting on the balcony getting a breath of fresh air and telling stories, I would put some music on, take hold of my "microphone," and start to sing.
zh_cn: 我记得有很多次我们全家人都在祖父家，大家都坐在阳台上透气和聊天，我就打开音乐，操起木勺“话筒”在大家面前演唱起来。

source: I have no doubt that back then no one ever imagined I'd end up becoming a professional artist (although I did have an uncle who always said, "When you get famous, call me and I'll come carry your luggage."
zh_cn: 毫无疑问，当时没人会觉得我日后成为一名艺人（尽管我叔叔的确曾说过：“改天你成名了，记得叫我给你提包啊。”

source: To which I would very seriously reply, "Of course!"
zh_cn: 当时我回毫不犹豫地回答：“没问题的。”

source: Needless to say, he hasn't come through with his end of the bargain...).
zh_cn: 当然这都是玩笑话。）

source: I'm sure they enjoyed watching me sing and dance around the house, but I know it never occurred to any of us that one day I would be doing just that before hundreds of thousands of people.
zh_cn: 我敢保证，他们一定非常喜欢看我在屋子里又唱又跳，不过我也清楚当时没有人想过有一天我也会在成千上万人面前又唱又跳。

source: As surprising as it may seem, the truth is that ever since I was a young boy, I have always known I was meant to be onstage.
zh_cn: 事实上我从很小的时候就知道站在舞台上意味着什么，很神奇是不是？

source: I can't say it was a conscious decision or that I woke up one day and said, "I want to be an artist." But I can say that I gradually started to realize what I really enjoy doing, and simply tried to do it as often as possible.
zh_cn: 不知是我当时深思熟虑过，还是有一天早上我突然醒来，然后决定说：“我想做艺人”，不过我知道的是，当时的我渐渐地开始喜欢我做的事情了，然后就是便越做越多。

source: I know it takes some people many years to figure out what they want to do with their lives, to find something that genuinely moves them, and I know it can be a difficult process.
zh_cn: 我知道有些人要花很长时间才能真正找到自己的兴趣所在，找到生命中最真实的动力，能做到这样是一件不容易的事情。

source: But I was lucky. For me, it was very instinctive.
zh_cn: 因而，我很幸运能在很小的时候就找到自己的兴趣所在。对我而言，唱歌就是一种本能。

source: Although at first all I did was grab the spoon and perform for my grandparents and aunts and uncles, I enjoyed it very much.
zh_cn: 尽管我最初仅仅是在我是拿着木勺在祖父、姨妈和叔叔面前表演，但我的的确确很享受这样的过程。

source: In this case, I believe it was more than a passing phase; it was something more powerful, because what started as a game ultimately turned into a passion.
zh_cn: 所以我知道这样的爱好绝非过眼云烟，音乐给了我无尽的动力，日后我在家人面前的游戏终于变成了一份让我充满激情的职业。

source: Slowly, I started to see that capturing other people's attention and having all those eyes on me was a rush.
zh_cn: 渐渐地，我发现吸引别人的目光和注意力让我获得了巨大的满足。

source: I loved feeling that I was entertaining them, that they were listening to me, and when I got big applause, I'd be thrilled to no end.
zh_cn: 能让家人高兴，能给他唱歌，并能获得他们的掌声让我很是享受，也让表演的我一直都精神饱满。

source: To this very day that feeling of being onstage continues to be a source of energy and inspiration for me.
zh_cn: 直至今日，站在舞台上的美妙感觉一直都我是前进的动力和力量的源泉。

source: Every time I find myself in front of an audience, be it twenty people or one hundred thousand, once again I feel the energy that consumed me back at the family gatherings of my youth.
zh_cn: 每每当我站在观众面前，无论是仅有20多人还是多达成千上万，我都会回想起当年我在家人面前全神贯注地表演的场景。

source: I am not exactly sure where my passion for being onstage comes from, but it somehow feels like I have to be in the spotlight; I want to be seen. . . .
zh_cn: 其实我也说不清楚，我对舞台的热爱具体源自于什么，但不知何故，我就是喜欢站在聚光灯下，就是喜欢别人们所关注......。

source: At some point during my childhood one of my cousins would produce plays--written by her--and it is there where I had my first experiences as an actor.
zh_cn: 在我小的时候，我一个表姐经常排演一些她写的戏剧，也正是在她的剧中我开始了我的演员生涯。

source: Apparently I liked it, because later when I was in school, each time they put on a play I was the first one to sign up.
zh_cn: 似乎我很喜欢这样表演，因为后来在我上学的时候，我总是第一个报名参加剧团表演的人。

source: I even became an altar boy, because to me, helping the priest was like being onstage, since he was very much "the star" of the show.
zh_cn: 我后来甚至当过教堂的祭台助手（通常由男童担任——译者注），对我而言在这样的场合帮助神父与登台献艺并无差别，因为祭台助手也常是人们注意的对象。

source: When I was onstage I felt complete and alive, so naturally I wanted to find that sensation at every opportunity.
zh_cn: 所以我站在舞台上，我浑身上下都充满活力，我也就不会放弃任何一次登台表演的机会。

source: Every so often I think about what would have happened if I had not chosen this path.
zh_cn: 有时我也会想，如果当初自己没有选择这条路，今天的我又会怎样呢？

source: It's almost inevitable to ask yourself these questions, and it's interesting to think about what would have become of each of our lives if we hadn't turned into the people we are today.
zh_cn: 人总是不可避免地会问自己这样的问题，而为这个问题寻找答案也是一件很有意思的事情。

source: What would I be had I not become an artist?
zh_cn: 如果不做艺人，我会怎样呢？

source: What other profession would I have chosen?
zh_cn: 我会选择什么职业呢？

source: Psychologist?
zh_cn: 心理咨询师？

source: Dentist?
zh_cn: 牙医？

source: Lawyer?
zh_cn: 还是律师？

source: My grandmother had always hoped that I'd be a doctor, but unfortunately I could never fulfill that dream.
zh_cn: 我祖母曾一直都希望我做一名医生，很可惜我让她老人家失望了。

source: Since the moment I realized what I wanted to do with myself, I've worked tirelessly to make that dream come true.
zh_cn: 自从我找到自己真正想做的事情之后，我一直孜孜不倦地努力着，以求自己的梦想有朝一日能成为现实。

source: But I always ask myself what would have become of me had I listened to my grandmother's advice, or had I taken some other path.
zh_cn: 不过我也曾问自己，要是我听从了祖母的建议，或者选择了其他什么职业，今天的我又会是怎样一副模样呢？

source: For example, when I was eighteen, I auditioned for the Tisch School at New York University, one of the most renowned drama schools in the country.
zh_cn: 比如，我18岁的时候，曾面试通过了纽约大学Tisch学院——这是全美最有名的戏剧学院。

source: But just a few months before classes began, instead of enrolling I went to Mexico to meet some friends, and there I landed--there really is no other way of seeing it, as it was such a coincidence--in the theater.
zh_cn: 不过就在开学前几个月，我和几个朋友去了墨西哥并放弃了入学的资格，随后我开始活跃在墨西哥当地的剧院里——这如果不能说是生命中的巧合，那还能算是什么？

source: What would have happened if I had stayed to go to New York University?
zh_cn: 如果当初我完成了纽约大学的学习会是怎样一番场景呢？

source: What direction would my life have taken if I had found success in acting instead of music?
zh_cn: 如果当初我选择成为演员而非歌手，我的生活又会是怎样一种状态？

source: My path would have, without a doubt, been different.
zh_cn: 毫无疑问我的生活会截然不同。

source: But I like to think that whether I had chosen acting, music, or dance, I would have somehow or other always chosen a path that in the end would make me feel happy and fulfilled.
zh_cn: 不过我觉得，无论当初我是选择了成为一名演员、还是歌手抑 或是舞者，我最终都会选择一条给我带来快乐和满足感的道路。

source: The truth is that what you do doesn't matter so much; what matters is that you love it and that you do it to the best of your ability.
zh_cn: 事实上，你做什么并不重要，重要的是你喜欢你所做的，并愿意为之努力从而做到最好。

source: Passion is a vital aspect of my existence.
zh_cn: 我生命中一直都充满了无限的热情。

source: I consider myself to be a realistic dreamer, and my life is full of intense emotions.
zh_cn: 我认为我自己一直都是一位现实的理想主义者，我的生命总是充满了各种饱满的情绪。

source: I live and feel deeply.
zh_cn: 我大胆地生活，也大胆地感受生活。

source: Some people may think it is wrong to live life so passionately, but the truth is that ever since I was a very little boy, it has been passion that has propelled me on the extraordinary trajectory that has been my life, so I see no reason to stop it.
zh_cn: 有些人认为，如此热情地去生活并不见得是件好事，不过事实上在我很小的时候，正是这股无所畏惧的热情让我走上了如今的人生道路，所以为什么要让这股热情冷却呢？

source: Had I not embraced my instincts at a very young age, I think I would have never gotten to where I am today.
zh_cn: 如果我在年幼时不曾紧紧抓住我的天资，我想我也不会成就今天的Ricky Martin。

source: To me, part of the beauty of childhood lies in the fact that it is a time of extremes: When we are happy, the happiness is absolute, and when we are sad, the pain is devastating.
zh_cn: 对我而言，童年的美妙之处就在于那是一个充满了各种极端情感的日子：那时的我们如果感到幸福，那一定是彻头彻尾的幸福；而如果我们感到悲伤，那一定是痛彻心扉的悲伤。

source: Life at that age is very intense, but at the same time it is also utterly pure and genuine.
zh_cn: 那个时候，生命中的一切都如此的强烈，同时一切又彻底的纯洁和真实。

source: As we grow up, we learn how to soothe the emotions that are too overwhelming, and though to a certain degree I've also had to grow up, I have always made an effort to stay in touch with my inner child--that passionate, energetic, and happy child who was never afraid of anything.
zh_cn: 当我们渐渐长大，我们也就慢慢学会了如何平复那些来势汹汹的感情，尽管从某种意义上说这是一种成长，但我依然尽量让自己不要忘掉心中那个孩子——那个充满热情、激情四射并无所畏惧的幸福孩子。
